---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.AdjustCurveTooShort
source: html/562a408c-b6a1-17e1-c91f-88ff03731ed3.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.AdjustCurveTooShort Property

AdjustCurve is too short.

## Syntax (C#)
```csharp
public static FailureDefinitionId AdjustCurveTooShort { get; }
```